In [2]:
import re
import pandas as pd
import numpy as np

In [3]:
text = """swati satpute, "Assistnt Professor", Fergusson College, 91-9822414323
Yash mehta, "Software Engineer", Ellicuium, 44-827743243"""

In [9]:
data = pd.DataFrame(columns=['name', 'designation', 'organization','countrycode', 'phone'])

for i, line in enumerate(text.split('\n')):
    print(line)
    name, designation, organization, phone = re.split(',', line)
    designation = designation.strip().strip('"')
    countrycode, phone = phone.split('-')
    data.loc[i] = [name, designation, organization, countrycode, phone]
    pass

data.head()

swati satpute, "Assistnt Professor", Fergusson College, 91-9822414323
Yash mehta, "Software Engineer", Ellicuium, 44-827743243

,name,designation,organization,countrycode,phone
0,swati satpute,Assistnt Professor,Fergusson College,91,9822414323
1,Yash mehta,Software Engineer,Ellicuium,44,827743243